app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Gee"], ["updated_at", "2017-03-02 00:55:33.858473"], ["id", 1]]
---
  def update
    # byebug
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))